Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t
Serialization structure for building hierarchy storey operation.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.id
The object id.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.aGuid
The guid of the building hierarchy item.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.aParentGuid
The guid of the building hierarchy parent item.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.aName
Name of the building hierarchy item.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.OperationType
Defines if this is a create, read, update, or delete operation.
Tekla.Structures.ModelInternal.dotObjectOperationsEnum

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.aDescription
The description of the building hierarchy storey.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.aLevelInfo
The level information of the building hierarchy storey.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.Elevation
Elevation of the storey.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.LevelOffset
Level Offset of the storey.

Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t.BottomOffset
Bottom offset of the storey.